#language:ru

Функциональность: Перевод средств

  Сценарий: : Перевод средств с карты 1 на карту 2 (позитивный)
    Пусть открыта страница с формой авторизации "http://localhost:9999"
    Когда пользователь пытается авторизоваться с именем "vasya" и паролем "qwerty123"
    И пользователь вводит проверочный код 'из смс' "12345"
    И происходит успешная авторизация и пользователь попадает на страницу 'Личный кабинет'
    И нажимает кнопку пополнить напротив первой карты
    И делает перевод на сумму "1000" и с карты "5559000000000002" и нажимает кнопку пополнить
    Тогда Возвращается на страницу 'Личный кабинет'